       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUM-CALCULATOR.
       AUTHOR. YALIXTECH.
       DATE-WRITTEN. 2024-03-14.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(5) VALUE 10.
       01 NUM2 PIC 9(5) VALUE 20.
       01 RESULT PIC 9(6).

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           COMPUTE RESULT = NUM1 + NUM2
           DISPLAY "The sum of " NUM1 " and " NUM2 " is " RESULT
           STOP RUN. 